; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_1 ?v5 - type_3 ?v1 - type_1)
 	      (pred_2 ?v8 - object ?v1 - type_1)
	      (pred_4 ?v5 - type_3 ?v6 - type_2)
	      (pred_3 ?v5 - type_3 ?v8 - object ?v6 - type_2))

   (:action op_2
       :parameters  (?v5 - type_3 ?v4 ?v7 - type_1)
       :precondition (and  (pred_1 ?v5 ?v4))
       :effect (and  (pred_1 ?v5 ?v7)
		     (not (pred_1 ?v5 ?v4))))

   (:action op_1
       :parameters (?v5 - type_3 ?v2 - object ?v3 - type_1 ?v6 - type_2)
       :precondition  (and  (pred_2 ?v2 ?v3) (pred_1 ?v5 ?v3) (pred_4 ?v5 ?v6))
       :effect (and (pred_3 ?v5 ?v2 ?v6)
		    (not (pred_2 ?v2 ?v3)) 
		    (not (pred_4 ?v5 ?v6))))

   (:action op_3
       :parameters (?v5 - type_3 ?v2 - object ?v3 - type_1 ?v6 - type_2)
       :precondition  (and  (pred_3 ?v5 ?v2 ?v6) (pred_1 ?v5 ?v3))
       :effect (and (pred_2 ?v2 ?v3)
		    (pred_4 ?v5 ?v6)
		    (not (pred_3 ?v5 ?v2 ?v6)))))

; problem
(define (problem gripper-2-3-2)
(:domain gripper-strips)
(:objects obj_05 obj_08 - type_3
obj_10 obj_01 obj_11 obj_03 - type_2
obj_02 obj_07 obj_04 - type_1
obj_06 obj_09 - object)
(:init
(pred_1 obj_05 obj_07)
(pred_4 obj_05 obj_10)
(pred_4 obj_05 obj_01)
(pred_1 obj_08 obj_07)
(pred_4 obj_08 obj_11)
(pred_4 obj_08 obj_03)
(pred_2 obj_06 obj_02)
(pred_2 obj_09 obj_04)
)
(:goal
(and
(pred_2 obj_06 obj_02)
(pred_2 obj_09 obj_07)
)
)

(:constraints
  (always (not (pred_1 obj_05 obj_04)))
)
)

; plan
1. (op_2 obj_08 obj_07 obj_04)
   deleted: (pred_1 obj_08 obj_07)
   added: (pred_1 obj_08 obj_04)
   goals met: 1 of 2
2. (op_1 obj_08 obj_09 obj_04 obj_03)
   deleted: (pred_2 obj_09 obj_04) (pred_4 obj_08 obj_03)
   added: (pred_3 obj_08 obj_09 obj_03)
   goals met: 1 of 2
3. (op_2 obj_08 obj_04 obj_07)
   deleted: (pred_1 obj_08 obj_04)
   added: (pred_1 obj_08 obj_07)
   goals met: 1 of 2
4. (op_3 obj_08 obj_09 obj_07 obj_03)
   deleted: (pred_3 obj_08 obj_09 obj_03)
   added: (pred_2 obj_09 obj_07) (pred_4 obj_08 obj_03)
   goals met: 2 of 2
